{
  "home": {
    "listen": "Écoutez de la bonne musique !"
  },
  "manage": {
    "my_songs": "Mes chansons"  },
  "forgot_password": {
    "title": "Réinitialiser le mot de passe",
    "link": "Mot de passe oublié ?",
    "instructions": "Entrez votre adresse e-mail et nous vous enverrons un lien pour réinitialiser votre mot de passe.",
    "send_reset_link": "Envoyer le lien de réinitialisation",
    "back_to_login": "Retour à la connexion",
    "sending": "Envoi du lien de réinitialisation...",
    "success": "Lien de réinitialisation du mot de passe envoyé ! Vérifiez votre e-mail.",
    "error": "Échec de l'envoi du lien de réinitialisation. Veuillez vérifier votre adresse e-mail."
  },
  "reset_password": {
    "title": "Réinitialiser votre mot de passe",
    "new_password": "Nouveau mot de passe",
    "new_password_placeholder": "Entrez un nouveau mot de passe",
    "confirm_password": "Confirmer le mot de passe",
    "confirm_password_placeholder": "Confirmez le nouveau mot de passe",
    "submit": "Réinitialiser le mot de passe",
    "resetting": "Réinitialisation de votre mot de passe...",
    "success": "Mot de passe réinitialisé avec succès !",
    "error": "Échec de la réinitialisation du mot de passe. Veuillez réessayer.",
    "invalid_link": "Lien de réinitialisation invalide ou manquant.",
    "expired_link": "Ce lien de réinitialisation a expiré ou est invalide.",
    "complete_message": "Votre mot de passe a été réinitialisé avec succès. Vous pouvez maintenant vous connecter avec votre nouveau mot de passe.",
    "go_to_login": "Aller à la connexion"
  },
  "about": {
    "hero_title": "À propos de Music Tracker",
    "hero_subtitle": "Votre plateforme personnelle de streaming et de partage de musique",
    "what_is_title": "Qu'est-ce que Music Tracker ?",
    "what_is_intro": "Music Tracker est une application Web progressive (PWA) moderne conçue pour aider les passionnés de musique à télécharger, gérer et partager leurs morceaux préférés avec une communauté grandissante. Construit avec des technologies de pointe comme Vue 3, Firebase et Vite, nous offrons une expérience fluide aux amateurs de musique pour découvrir et profiter du contenu audio.",
    "what_is_outro": "Que vous soyez un artiste en herbe cherchant à partager votre travail ou un mélomane souhaitant découvrir de nouveaux sons, Music Tracker fournit les outils et la plateforme dont vous avez besoin.",
    "features_title": "Fonctionnalités principales",
    "feature_upload_title": "Téléchargement facile",
    "feature_upload_desc": "Téléchargez jusqu'à 10 morceaux (15 Mo chacun) avec notre interface intuitive par glisser-déposer. Gérez votre bibliothèque musicale avec suivi de progression en temps réel.",
    "feature_stream_title": "Écoutez partout",
    "feature_stream_desc": "Profitez du streaming audio de haute qualité avec notre lecteur intégré. Contrôlez le volume, naviguez dans les pistes et gardez la musique en lecture sur toutes les pages.",
    "feature_community_title": "Engagement communautaire",
    "feature_community_desc": "Partagez vos réflexions et connectez-vous avec d'autres amateurs de musique grâce à notre système de commentaires. Discutez des morceaux, partagez vos commentaires et créez des liens.",
    "feature_language_title": "Support multilingue",
    "feature_language_desc": "Accédez à la plateforme dans plusieurs langues avec notre internationalisation intégrée. Prend actuellement en charge l'anglais et le français.",
    "feature_pwa_title": "Technologie PWA",
    "feature_pwa_desc": "Profitez d'un accès hors ligne et d'une expérience semblable à une application sur n'importe quel appareil. Installez Music Tracker sur votre téléphone ou votre ordinateur pour un accès rapide.",
    "feature_secure_title": "Sécurisé et privé",
    "feature_secure_desc": "Vos données sont protégées par l'authentification Firebase et les règles de sécurité. Vous seul pouvez gérer et supprimer vos morceaux téléchargés.",
    "tech_title": "Construit avec",
    "tech_vue": "Framework JavaScript progressif avec API de composition",
    "tech_firebase": "Authentification, stockage et base de données Firestore",
    "tech_vite": "Outillage frontend de nouvelle génération pour un développement rapide",
    "tech_tailwind": "Framework CSS utilitaire pour un design moderne",
    "tech_howler": "Bibliothèque audio pour un contrôle de lecture puissant",
    "tech_veevalidate": "Validation de formulaire pour une meilleure expérience utilisateur",
    "limits_title": "Avis de plateforme de test",
    "limits_intro": "Music Tracker est actuellement en {0} mode test {1}. Pour garantir des performances optimales et une gestion des ressources, les limites suivantes sont en place :",
    "limits_tracks": "Maximum de 10 morceaux par compte utilisateur",
    "limits_filesize": "Limite de taille de fichier de 15 Mo par morceau",
    "limits_format": "Format MP3 uniquement (audio/mpeg)",
    "limits_note": "Ces limites nous aident à maintenir un environnement de test stable et peuvent être ajustées dans les versions futures.",
    "start_title": "Commencer",
    "start_step1_title": "Créer un compte",
    "start_step1_desc": "Inscrivez-vous avec votre e-mail pour commencer. Cela ne prend qu'un instant !",
    "start_step2_title": "Téléchargez votre musique",
    "start_step2_desc": "Accédez à la page Gérer et téléchargez vos morceaux MP3 préférés.",
    "start_step3_title": "Découvrez et partagez",
    "start_step3_desc": "Parcourez la page d'accueil, écoutez des morceaux et engagez-vous avec la communauté !"  }
}
